appsor-backend/app/controllers/api/applicants_controller.rb

INSERT INTO "applicants" ("last_name", "first_name", "middle_initial", "student_number", "email", "contact_number", "birthday", "nickname", "address", "skills", "interests", "experience", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
---
    def create
      @applicant = Applicant.new(applicant_params)

      if @applicant.save

SELECT "applicants".* FROM "applicants"
---
    def index
      @applicants = Applicant.all

UPDATE "applicants" SET "first_name" = $1, "updated_at" = $2 WHERE "applicants"."id" = $3  [["first_name", "Zac"], ["updated_at", "2018-06-23 11:23:24.011527"], ["id", 2]]
---
    def update
      if @applicant.update(applicant_params)

SELECT  "applicants".* FROM "applicants" WHERE "applicants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_applicant
      @applicant = Applicant.find(params[:id])