appsor-backend/app/controllers/api/committees_controller.rb

INSERT INTO "committees" ("name", "desc", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Engineering Committee"], ["desc", "Best Committee"], ["created_at", "2018-06-23 12:37:24.636329"], ["updated_at", "2018-06-23 12:37:24.636329"]]
---
    def create
      @committee = Committee.new(committee_params)

      if @committee.save

SELECT "committees".* FROM "committees"
---
    def index
      @committees = Committee.all

UPDATE "committees" SET "name" = $1, "desc" = $2, "updated_at" = $3 WHERE "committees"."id" = $4  [["name", "Development Committee"], ["desc", "The old version"], ["updated_at", "2018-06-23 12:40:50.402698"], ["id", 1]]
---
    def update
      if @committee.update(committee_params)

SELECT  "committees".* FROM "committees" WHERE "committees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_committee
      @committee = Committee.find(params[:id])